import { Question } from '../types';

export const subjects = [
  "Tasawuf/Akhlak",
  "Fekah",
  "Al-Quran & Tajwid",
  "Tauhid/Akidah",
  "Tadribat Ilmi/Bahasa Arab",
  "Sirah",
  "Uslub Dakwah",
  "Hadis"
];

export const questionBank: Record<string, Question[]> = {
  "Tasawuf/Akhlak": [],
  "Fekah": [
  {
    "id": 21,
    "text": "اءير يڠ سوچي لاݢي مڽوچيكن اياله:",
    "options": [
      "اءير مستعمل",
      "اءير متنجس",
      "اءير مطلق",
      "اءير برچمڤور صابون"
    ],
    "correctAnswer": 2
  },
  {
    "id": 22,
    "text": "نجيس مغلظة اياله نجيس يڠ:",
    "options": [
      "ريڠن سڤرتي اءير كنچيڠ بايي للاكي بلوم ماكن",
      "ڤرتڠهن سڤرتي داره",
      "برت سڤرتي انجيڠ دان بابي",
      "تيدق ڤرلو دسامق"
    ],
    "correctAnswer": 2
  },
  {
    "id": 23,
    "text": "اءير متنجس بوليه دݢوناكن اڤابيلا:",
    "options": [
      "تيدق برباو",
      "تيدق بروبه ورنا",
      "تيدق بروبه صفت",
      "تيدق بوليه دݢوناكن سام سكالي"
    ],
    "correctAnswer": 3
  },
  {
    "id": 24,
    "text": "روكون صلاة يڠ ڤرتام اياله:",
    "options": [
      "تكبيرة الإحرام",
      "برديري تݢق",
      "نية",
      "الفاتحة"
    ],
    "correctAnswer": 2
  },
  {
    "id": 25,
    "text": "مأموم مسبوق اياله:",
    "options": [
      "مأموم يڠ داتڠ اول",
      "مأموم يڠ ترلوت ساتو ركعة اتاو لبيه",
      "مأموم يڠ تيدق برنية",
      "مأموم يڠ ممباچ قوات"
    ],
    "correctAnswer": 1
  },
  {
    "id": 26,
    "text": "سنة أبعاض دالم صلاة اياله:",
    "options": [
      "تشهد أول",
      "ممباچ دعاء قنوت",
      "مڠڠكت تاڠن كتيک تكبير",
      "دودوق انتارا دوا سجود"
    ],
    "correctAnswer": 0
  },
  {
    "id": 27,
    "text": "وقوف دعرفة برلاكو ڤد:",
    "options": [
      "٨ ذوالحجة",
      "٩ ذوالحجة",
      "١٠ ذوالحجة",
      "١١ ذوالحجة"
    ],
    "correctAnswer": 1
  },
  {
    "id": 28,
    "text": "طواف إفاضة ترماسوق دالم:",
    "options": [
      "سنة حج",
      "واجب حج",
      "روكون حج",
      "دم حج"
    ],
    "correctAnswer": 2
  },
  {
    "id": 29,
    "text": "شرط واجب حج ترماسوقله:",
    "options": [
      "إسلام، بالغ، برعلمو دان صيحت",
      "إسلام، برعقل، مرديكا دان ممڤو",
      "إسلام، كاي دان تيدق برهوتڠ",
      "إسلام، للاكي دان صيحت"
    ],
    "correctAnswer": 1
  },
  {
    "id": 30,
    "text": "زكاة فطرة دواجبكن كأتس:",
    "options": [
      "ستياڤ مسلم يڠ هيدوڤ ڤد مالم ١ شوال",
      "اورڠ ديواسا سهاج",
      "اورڠ كاي سهاج",
      "كتوا كلوارݢ سهاج"
    ],
    "correctAnswer": 0
  },
  {
    "id": 31,
    "text": "نصاب زكاة هرتا دتنتوكن برداسركن نيلاي:",
    "options": [
      "امس",
      "ڤيرق",
      "تانه",
      "واڠ توناي"
    ],
    "correctAnswer": 0
  },
  {
    "id": 32,
    "text": "ݢولوڠن يڠ تيدق لايق منريما زكاة اياله:",
    "options": [
      "في سبيل الله",
      "عامل",
      "كلوارݢ نبي محمد ﷺ",
      "ابن سبيل"
    ],
    "correctAnswer": 2
  },
  {
    "id": 33,
    "text": "روكون وقف يڠ ڤاليڠ اساس اياله:",
    "options": [
      "صيغة، ڤواقف، ڤنريما دان هرتا",
      "ڤواقف، سقسي، هرݢ دان نية",
      "هرتا، سقسي، دان تمڤوه",
      "ڤواقف دان ڤنريما سهاج"
    ],
    "correctAnswer": 0
  },
  {
    "id": 34,
    "text": "هرتا وقف مستيله:",
    "options": [
      "هرتا يڠ دميليقي سچارا صح دان بوليه دمنفعتكن",
      "هرتا ڤينجمن",
      "هرتا موده روسق",
      "هرتا يڠ بلوم دميليقي"
    ],
    "correctAnswer": 0
  },
  {
    "id": 35,
    "text": "وقف عام برمقصود:",
    "options": [
      "وقف اونتوق اهلي كلوارݢ ترتنتو",
      "وقف اونتوق توجوان عموم تنڤا حد ڤنريما",
      "وقف اونتوق ساتو مسجد سهاج",
      "وقف اونتوق هرتا تانه"
    ],
    "correctAnswer": 1
  },
  {
    "id": 36,
    "text": "روكون جوال بلي اياله:",
    "options": [
      "ڤنجوال، ڤمبلي، عقد، بارڠ دان هرݢ",
      "ڤنجوال، ڤمبلي، سقسي دان ڤرجنجين",
      "بارڠ دان سقسي",
      "هاڽ عقد سهاج"
    ],
    "correctAnswer": 0
  },
  {
    "id": 37,
    "text": "جوال بلي نجشي اياله:",
    "options": [
      "جوال بلي دڠن تيڤو حيله اونتوق نايقكن هرݢ",
      "جوال بلي سچارا انسورن",
      "جوال بلي صح تنڤا عقد",
      "جوال بلي بارڠ حرام"
    ],
    "correctAnswer": 0
  },
  {
    "id": 38,
    "text": "جوال بلي يڠ دلارڠ دالم إسلام اياله:",
    "options": [
      "مرابحة",
      "بيع غرر",
      "سلم",
      "استصناع"
    ],
    "correctAnswer": 1
  },
  {
    "id": 39,
    "text": "كيت دݢالقكن ملاكوكن صلاة سنة رواتب تراوتاماڽ صلاة:",
    "options": [
      "سبلوم صبح",
      "سلڤس صبح",
      "سبلوم مغرب",
      "سلڤس عصر"
    ],
    "correctAnswer": 0
  },
  {
    "id": 40,
    "text": "ݢرهانا ماتاهاري داصطلاحكن سباݢاي صلاة:",
    "options": [
      "الخسوف",
      "الفسوس",
      "الكسوف",
      "الخصوص"
    ],
    "correctAnswer": 2
  },
  {
    "id": 41,
    "text": "أحمد منونايكن صلاة تراويح سچارا برجماعة",
    "options": [
      "سنة",
      "واجب",
      "حرام",
      "مكروه"
    ],
    "correctAnswer": 0
  },
  {
    "id": 42,
    "text": "كريم منونايكن صلاة حاجت سلڤس ترجݢ درڤد تيدور ڤد جم ٤.٣٠ ڤاݢي",
    "options": [
      "سنة",
      "واجب",
      "حرام",
      "مكروه"
    ],
    "correctAnswer": 0
  },
  {
    "id": 43,
    "text": "علي منونايكن صلاة سنة توبة سلڤس صلاة صبح",
    "options": [
      "سنة",
      "واجب",
      "مكروه تنزيه",
      "مكروه تحريم"
    ],
    "correctAnswer": 3
  },
  {
    "id": 44,
    "text": "اڤاكه حكوم اصل ڤركهوينن دالم إسلام",
    "options": [
      "سنة",
      "واجب",
      "حرام",
      "مكروه"
    ],
    "correctAnswer": 0
  },
  {
    "id": 45,
    "text": "أحمد برڤواسا ڤد ١١ ذوالحجة",
    "options": [
      "سنة",
      "واجب",
      "حرام",
      "مكروه"
    ],
    "correctAnswer": 2
  },
  {
    "id": 46,
    "text": "ابو ممباير فدية دسببكن تيدق ممڤو برڤواسا كران ساكيت يڠ تياد هارڤن سمبوه",
    "options": [
      "سنة",
      "واجب",
      "حرام",
      "مكروه"
    ],
    "correctAnswer": 1
  },
  {
    "id": 47,
    "text": "دسنتكن خطبة ..... صلاة ݢرهانا:",
    "options": [
      "سبلوم",
      "سماس",
      "سلڤس",
      "بيلا-بيلا"
    ],
    "correctAnswer": 2
  },
  {
    "id": 48,
    "text": "برايكوت اداله روكون نكاح كچوالي:",
    "options": [
      "ڤڠنتين للاكي",
      "ڤڠنتين ڤرمڤوان",
      "جورو نكاح (قاضي)",
      "٢ اورڠ سقسي"
    ],
    "correctAnswer": 2
  },
  {
    "id": 49,
    "text": "برايكوت اداله شرط صح رجوع كچوالي:",
    "options": [
      "استري ماسيه عدة رجعي",
      "دروجوع اوليه سوامي يڠ صح",
      "دشرطكن ڤرستوجوان استري",
      "رجوع دبوات دڠن لفظ يڠ منونجوقكن اونتوق كمبالي"
    ],
    "correctAnswer": 2
  },
  {
    "id": 50,
    "text": "برايكوت اداله سومبر ڤروندڠن إسلام كچوالي:",
    "options": [
      "القرءان",
      "السنة",
      "مقاصد",
      "إجماع"
    ],
    "correctAnswer": 2
  },
  {
    "id": 51,
    "text": "وكالة اياله كواس كڤد سسأورڠ اونتوق ملقساناكن اوروسن باݢي ڤيهق اورڠ لاءين دالم ڤركارا يڠ ..... دواكيلكن",
    "options": [
      "واجب",
      "سنة",
      "حرام",
      "هاروس"
    ],
    "correctAnswer": 3
  },
  {
    "id": 52,
    "text": "حكوم ربا دالم إسلام اياله:",
    "options": [
      "واجب",
      "سنة",
      "حرام",
      "هاروس"
    ],
    "correctAnswer": 2
  },
  {
    "id": 53,
    "text": "عبادة حج دفرضوكن ڤد تاهون ك ..... هجرة",
    "options": [
      "٧",
      "٨",
      "٦",
      "١٠"
    ],
    "correctAnswer": 2
  },
  {
    "id": 54,
    "text": "اڤ ارتي كممڤوان دالم عبادة حج",
    "options": [
      "ممڤو منونايكن عبادة حج دڠن سنديري",
      "ممڤو منونايكن عبادة حج دڠن ڤرتولوڠن اورڠ لاءين",
      "ممڤو منونايكن عبادة حج دڠن كواڠن دان فيزيكل",
      "مامڤو منونايكن عبادة حج دڠن سنديري اتاو ڤرتولوڠن اورڠ لاءين"
    ],
    "correctAnswer": 3
  },
  {
    "id": 55,
    "text": "اڤاكه حكوم منونايكن حج ملالوءي هوتڠ يڠ ممڤو دباير:",
    "options": [
      "واجب",
      "حرام",
      "سنة",
      "هاروس"
    ],
    "correctAnswer": 3
  },
  {
    "id": 56,
    "text": "اداكه صح حج سسأورڠ يڠ مڠݢوناكن واڠ ڤمڤاسن اينسورن",
    "options": [
      "صح",
      "سنة",
      "باطل",
      "حرام"
    ],
    "correctAnswer": 0
  },
  {
    "id": 57,
    "text": "اليف تله مڠرجاكن كرجا-كرجا عمرة كچوالي تحلل سهاج يڠ بلوم لاݢي، كمودين ڤولڠ كهوتيل مماكاي سلوار دالم تنڤا دسدري. اڤابيلا دسدري لالو دتڠݢلكن دڠن سݢرا كمودين برتحلل، اڤاكه حكومڽ:",
    "options": [
      "بردوسا دان كنا باير دم",
      "تيدق بردوسا دان كنا باير دم",
      "تيدق بردوسا دان تيدق دكناكن دم",
      "تياد ادا اڤ-اڤ"
    ],
    "correctAnswer": 2
  },
  {
    "id": 58,
    "text": "اداكه صح سعي سوامي استري يڠ سام-سام مڠرجاكن سعي دالم كأداءن سوامي منولق استري يڠ براد دأتس كرسي رودا كران استري عذور تيدق داڤت برجالن",
    "options": [
      "صح سعي سوامي سهاج",
      "صح سعي استري سهاج",
      "تيدق صح كدوا-دواڽ",
      "صح دڠن شرط سواميڽ مڠقصدكن اونتوق سعي دان بوكن سمات-مات منولق"
    ],
    "correctAnswer": 3
  },
  {
    "id": 59,
    "text": "باݢايمانا دڠن كدودوقن طواف باݢي جماعه حج ممݢڠ تاڠن استري دالم كأداءن برلاڤيق سماس طواف دان ڤد ماس يڠ سام ترغسڠ شهوة",
    "options": [
      "صح طواف ترسبوت جك تيدق كلوار اءير مذي دان تيدق بردوسا",
      "تيدق صح طواف ترسبوت جك كلوار اءير مذي دان بردوسا",
      "تيدق صح دان دكناكن بايرن دم دان تيدق بردوسا",
      "صح جك تيدق كلوار اءير مذي تتاڤي حرام دان بردوسا سرتا دكناكن بايرن دم"
    ],
    "correctAnswer": 0
  },
  {
    "id": 60,
    "text": "اڤاكه حكومڽ اورڠ يڠ سوده تحلل كمودين دي ترايڠت دڠن يقين بهاوا طوافڽ تيدق چوقوڤ ٧ ڤوسيڠن:",
    "options": [
      "طواف ايت صح دان تيدق دكناكن دم",
      "طواف ايت تيدق صح دان اي واجب منچوقوڤكن طوافڽ",
      "دي واجب كلوار برنية دميقات دان ممڤربهاروءي طواف دان سعيڽ سمولا",
      "طوافڽ تيدق صح دان واجب منچوقوڤكن طوافڽ دان برتحلل سرتا واجب ممباير دم"
    ],
    "correctAnswer": 3
  },
  {
    "id": 61,
    "text": "بيلاكه برمولا وقت ملونتر ڤد هاري-هاري تشريق؟",
    "options": [
      "سلڤس تڠه مالم ١٠ ذوالحجة",
      "سلڤس صبح ١١ ذوالحجة",
      "سلڤس ضحى ١١ ذوالحجة",
      "سلڤس ݢلينچير ماتاهاري ڤد ١١، ١٢ ذوالحجة دان جاتوه ماتاهاري ڤد ١٣ ذوالحجة"
    ],
    "correctAnswer": 1
  },
  {
    "id": 62,
    "text": "بوليهكه استري يڠ داتڠ حيض مواكيلكن كڤد سواميڽ اونتوق ملونتر جمرة",
    "options": [
      "بوليه كران استري عذور شرعي",
      "مكروه كران مڽوروه سوامي",
      "تيدق بوليه تتاڤي دبوليهكن كڤد اورڠ لاءين",
      "تيدق بوليه، استري مستي ملونتر سنديري جمرة"
    ],
    "correctAnswer": 3
  },
  {
    "id": 63,
    "text": "اڤاكه حكوم أحمد ممباير زكاة فطرة سلڤس صلاة هاري راي عيد الفطري",
    "options": [
      "مكروه",
      "تيدق صح",
      "حرام دان واجب قضاء",
      "بردوسا دان واجب قضاء"
    ],
    "correctAnswer": 0
  },
  {
    "id": 64,
    "text": "برايكوت مروڤاكن اورڠ يڠ دتونتوت برقربان كچوالي",
    "options": [
      "إسلام",
      "بركممڤوان",
      "بالغ دان برعقل",
      "صيحت توبوه بادن"
    ],
    "correctAnswer": 3
  },
  {
    "id": 65,
    "text": "وقت قربان اياله",
    "options": [
      "١٠ ذوالحجة",
      "١٠ دان ١١ ذوالحجة",
      "١٠، ١١، ١٢ دان ١٣ ذوالحجة",
      "١٠، ١١، ١٢، ١٣ دان ١٤ ذوالحجة"
    ],
    "correctAnswer": 2
  },
  {
    "id": 66,
    "text": "حكوم صلاة جنازة اياله",
    "options": [
      "سنة",
      "هاروس",
      "فرض عين",
      "فرض كفاية"
    ],
    "correctAnswer": 3
  },
  {
    "id": 67,
    "text": "اڤاكه حكوم وانيتا مڠيريڠي جنازة كقبور؟",
    "options": [
      "واجب",
      "سنة",
      "حرام",
      "مكروه"
    ],
    "correctAnswer": 3
  },
  {
    "id": 68,
    "text": "برايكوت اياله روكون خطبة ملاءينكن",
    "options": [
      "مموجي الله تعالى دڠن سبارڠ لفظ",
      "مموجي نبي دڠن سبارڠ لفظ",
      "نصيحت سوڤاي برتقوى دڠن سبارڠ لفظ",
      "نصيحت سوڤاي برصبر دڠن سبارڠ لفظ"
    ],
    "correctAnswer": 3
  },
  {
    "id": 69,
    "text": "برايكوت مروڤاكن روكون روكون ڤوساك كچوالي",
    "options": [
      "وارث",
      "اورڠ يڠ مواريثكن هرتا",
      "هرتا",
      "صيغة جوال بلي هرتا"
    ],
    "correctAnswer": 3
  },
  {
    "id": 70,
    "text": "انتارا برايكوت، يڠ بوكن ترماسوق دالم هالڠن ڤوساك اياله",
    "options": [
      "ممبونوه ڤوارث",
      "برلاءينن اݢام",
      "همبا",
      "باڽق برهوتڠ"
    ],
    "correctAnswer": 3
  },
  {
    "id": 71,
    "text": "اڤاكه يڠ دمقصودكن دڠن موانع الإرث",
    "options": [
      "شرط منريما ڤوساك",
      "سبب سسأورڠ مواريثي",
      "ڤركارا يڠ مڠهالڠ سسأورڠ درڤد منداڤت ڤوساك",
      "جنيس وارث للاكي دان ڤرمڤوان"
    ],
    "correctAnswer": 2
  },
  {
    "id": 72,
    "text": "تمڤوه حيض ڤاليڠ مينيموم اياله",
    "options": [
      "١٢ جم",
      "كورڠ ١٢ جم",
      "سهاري سمالم",
      "كورڠ ساتو هاري ساتو مالم"
    ],
    "correctAnswer": 2
  },
  {
    "id": 73,
    "text": "تمڤوه حيض ڤاليڠ مكسيما اياله",
    "options": [
      "٧ هاري",
      "١٠ هاري",
      "١٢ هاري",
      "١٥ هاري"
    ],
    "correctAnswer": 3
  },
  {
    "id": 74,
    "text": "ڤركارا برايكوت دحرامكن كران حيض كچوالي",
    "options": [
      "صلاة",
      "باچ القرءان",
      "برهنتي دالم مسجد",
      "برذكر دان برصلوات"
    ],
    "correctAnswer": 3
  },
  {
    "id": 75,
    "text": "نفاس اياله داره يڠ كلوار سلڤس كلاهيرن انق. براڤاكه تمڤوه مينيموم دان مكسيمومڽ",
    "options": [
      "١ جم دان ٤٠ هاري",
      "١ جم دان ٦٠ هاري",
      "سدتيک دان ٤٠ هاري",
      "سدتيک دان ٦٠ هاري"
    ],
    "correctAnswer": 3
  },
  {
    "id": 76,
    "text": "اڤاكه حكوم لفظ چراي ملالوءي SMS، Whatsapp دان سباݢايڽ. چونتوهڽ، \"مولاى هاري اين اڠكاو ترطلاق\"",
    "options": [
      "تيدق جاتوه طلاق دان تيدق بردوسا",
      "تيدق جاتوه كران بوكن برهادڤن",
      "جاتوه طلاق تتاڤي بوليه مينتا معاف",
      "جاتوه طلاق جك نية سوامي منچرايكنڽ"
    ],
    "correctAnswer": 3
  },
  {
    "id": 77,
    "text": "اڤاكه مقصود ظهار دالم ڤركهوينن",
    "options": [
      "طلاق تيݢ يڠ دأوچڤكن سوامي",
      "مڽاماكن استريڽ سڤرتي بلاكڠ ڤوڠݢوڠ ايبوڽ",
      "استري منونتوت نفقة سوامي",
      "سوامي اڠݢن منونايكن حق استري"
    ],
    "correctAnswer": 1
  },
  {
    "id": 78,
    "text": "برايكوت مروڤاكن عيب يڠ دبوليهكن فسخ يڠ مڠهالڠ ڤرستوبوهن كچوالي",
    "options": [
      "ذكر ترڤوتوس",
      "ماتي ڤوچوق",
      "فرج يڠ ترسومبت اوليه تولڠ اتاو داݢيڠ",
      "ڤڽاكيت كوستا، سوڤق دان ݢيلا"
    ],
    "correctAnswer": 3
  },
  {
    "id": 79,
    "text": "برايكوت مروڤاكن سبب-سبب نشوز كچوالي",
    "options": [
      "برمسافر تنڤا ايذين دان رضا سوامي",
      "استري تيدق ممبوك ڤينتو اونتوق سواميڽ ماسوق",
      "استري كلوار مسافر تنڤا سبب دان تنڤا ايذين سواميڽ",
      "استري كلوار بكرجا اونتوق ممبنتو كڤرلوان رومه تڠݢ دڠن كإيذينن سوامي"
    ],
    "correctAnswer": 3
  },
  {
    "id": 80,
    "text": "اڤاكه تمڤوه عدة باݢي وانيتا يڠ كماتين سوامي",
    "options": [
      "٣ بولن",
      "٣ كالي سوچي",
      "٤ بولن ١٠ هاري",
      "٦ بولن"
    ],
    "correctAnswer": 2
  },
  {
    "id": 81,
    "text": "حضانة اياله حق ڤنجاݢاءن انق باݢي ايبو بربنديڠ باڤ. برايكوت مروڤاكن توروتن حق ڤنجاݢاءن سلڤس ايبو",
    "options": [
      "نينيق سبله باڤ دان كأتس",
      "نينيق سبله ايبو دان كأتس",
      "ساودارا ڤرمڤوان سايبو سباڤ",
      "ساودارا ڤرمڤوان سبله باڤ"
    ],
    "correctAnswer": 1
  }
],
  "Tauhid/Akidah": [],
  "Tadribat Ilmi/Bahasa Arab": [],
  "Sirah": [],
  "Uslub Dakwah": [],
  "Hadis": [],
  "Al-Quran & Tajwid": [
    {
      id: 1,
      text: "اڤابيلا نون ماتي برتمو حروف ياء، حكوم تجويدڽ اياله",
      options: ["إدغام بلا غنة", "إدغام بغنة", "إقلاب", "إخفاء"],
      correctAnswer: 1
    },
    {
      id: 2,
      text: "نون ماتي برتمو حروف تاء دباچ دڠن حكوم",
      options: ["إدغام", "إقلاب", "إخفاء", "إظهار"],
      correctAnswer: 2
    },
    {
      id: 3,
      text: "اڤابيلا تنوين برتمو حروف باء، مک حكومڽ اياله",
      options: ["إقلاب", "إظهار", "إدغام", "إخفاء"],
      correctAnswer: 0
    },
    {
      id: 4,
      text: "حروف-حروف إظهار برجومله",
      options: ["٤", "٥", "٦", "٧"],
      correctAnswer: 2
    },
    {
      id: 5,
      text: "حروف-حروف إدغام بغنة اياله",
      options: ["ياء، نون، ميم، واو", "ياء، نون، ميم، لام", "ياء، نون، ميم، را", "ياء، نون، ميم، عين"],
      correctAnswer: 0
    },
    {
      id: 6,
      text: "نون ماتي برتمو حروف راء ممباوا حكوم",
      options: ["إدغام بغنة", "إدغام بلا غنة", "إقلاب", "إظهار"],
      correctAnswer: 1
    },
    {
      id: 7,
      text: "حروف إقلاب اياله",
      options: ["ميم", "باء", "تاء", "جيم"],
      correctAnswer: 1
    },
    {
      id: 8,
      text: "حروف إظهار دناماكن حروف",
      options: ["حلقي", "قلقله", "لساني", "شفوي"],
      correctAnswer: 0
    },
    {
      id: 9,
      text: "حروف إخفاء برجومله",
      options: ["١٠", "١٢", "١٥", "١٧"],
      correctAnswer: 2
    },
    {
      id: 10,
      text: "باچاءن \"مِنْ قَبْل\" منونجوقكن حكوم",
      options: ["إظهار", "إدغام", "إخفاء", "إقلاب"],
      correctAnswer: 2
    },
    {
      id: 11,
      text: "حروف-حروف إدغام بلا غنة اياله",
      options: ["راء دان لام", "ميم دان واو", "ياء دان نون", "تاء دان ياء"],
      correctAnswer: 0
    },
    {
      id: 12,
      text: "نون ماتي برتمو \"خاء\" ممباوا حكوم",
      options: ["إظهار", "إخفاء", "إدغام", "إقلاب"],
      correctAnswer: 0
    },
    {
      id: 13,
      text: "اڤاكه تندا إقلاب دالم مصحف القرآن؟",
      options: ["ميم كچيل", "حروف نون كچيل", "باريس دوا", "سكون"],
      correctAnswer: 0
    },
    {
      id: 14,
      text: "باچاءن ”سَمِيعٌ بَصِيرٌ“ اياله چونتوه",
      options: ["إدغام", "إخفاء", "إقلاب", "إظهار"],
      correctAnswer: 2
    },
    {
      id: 15,
      text: "نون ماتي برتمو حروف “حاء” دباچ دڠن حكوم",
      options: ["إظهار", "إخفاء", "إقلاب", "إدغام"],
      correctAnswer: 0
    },
    {
      id: 16,
      text: "ميم ماتي برتمو حروف \"باء\" دباچ دڠن حكوم",
      options: ["إخفاء شفوي", "إدغام ميمي", "إظهار شفوي", "إقلاب"],
      correctAnswer: 0
    },
    {
      id: 17,
      text: "براڤاكه جومله حكوم ميم ماتي؟",
      options: ["دوا", "تيݢ", "امڤت", "ليما"],
      correctAnswer: 1
    },
    {
      "id": 18,
      "text": "حكوم إخفاء شفوي برلاكو اڤابيلا ميم ماتي برتمو",
      "options": ["باء", "فاء", "ميم", "نون"],
      "correctAnswer": 0
    },
    {
      "id": 19,
      "text": "إدغام ميمي برلاكو اڤابيلا ميم ماتي برتمو",
      "options": ["باء", "ميم", "فاء", "لام"],
      "correctAnswer": 1
    },
    {
      "id": 20,
      "text": "حكوم إظهار شفوي برلاكو اڤابيلا ميم ماتي برتمو",
      "options": ["سموا حروف كچوالي ميم دان باء", "ميم سهاج", "باء سهاج", "حروف قلقلة"],
      "correctAnswer": 0
    }
  ]
};

// Fallback legacy export just in case
export const questions: Question[] = questionBank["Al-Quran & Tajwid"];
